hackathon/src/InformationRegisters/СостояниеОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОбращений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СлужебныйКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обращения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

hackathon/src/InformationRegisters/ПоказателиSLAПоОбращениям/ПоказателиSLAПоОбращениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиSLAПоОбращениям</name>
  <resources>
    <name>Реакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовторнаяРеакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/InformationRegisters/НавыкиСотрудников/НавыкиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НавыкиСотрудников</name>
  <resources>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКомпетенции</name>
    <type>
      <types>EnumRef.ТипыКомпетенцийСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/InformationRegisters/СтатусыHTTPЗапросов/СтатусыHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыHTTPЗапросов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектЗапроса</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
      <types>CatalogRef.Обращения</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияHTTPЗапросов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/Enums/ДействияHTTPЗапросов/ДействияHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияHTTPЗапросов</name>
  <enumValues>
    <name>ОбновлениеОбращенийДаннымиИзЭлемента</name>
  </enumValues>
  <enumValues>
    <name>СозданиеИсточникаДаннымиИзЭлемента</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеДанныхИзЭлемента</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаТекстаИИ</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеДанныхИзТГ</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеОбращенийДаннымиИзТГ</name>
  </enumValues>
  <enumValues>
    <name>СозданиеОбращенияНаОснованииИсточника</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаДанныхВЭлемент</name>
  </enumValues>
  <enumValues>
    <name>ПоискОтветаВFAQ</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/Enums/ТипыОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТехническаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВопросПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Жалоба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/СтатусыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ПриоритетыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПриоритетыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Срочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ТональностьОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТональностьОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Позитивная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нейтральная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Негативная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ИсточникиОбращений/ИсточникиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиОбращений</name>
  <enumValues>
    <name>РучноеСоздание</name>
  </enumValues>
  <enumValues>
    <name>СозданиеИзФормыОбработки</name>
  </enumValues>
  <enumValues>
    <name>Телеграм</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/CommonModules/СРОО_ОбщегоНазначения/Module.bsl
Функция ОтправитьЗапросКСерверу(ТекстЗапроса, СсылкаИсточник = Неопределено) Экспорт 
		
    Попытка
		
		НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.ОпубликованныйСервер);
		Заголовки = НастройкиПодключения.Заголовки;
		
		Запрос = Новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[0], Заголовки); 
		JSONТекст = "{""text"": """ + ТекстЗапроса + """}";
		Запрос.УстановитьТелоИзСтроки(JSONТекст, КодировкаТекста.UTF8);
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(НастройкиПодключения.URL,,,,,90,ЗащищенноеСоединение);
        Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура; 
		Если СсылкаИсточник <> Неопределено Тогда 
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СсылкаИсточник);
		Иначе                                                
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", "Неопределено");	
		КонецЕсли;
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ОтправкаТекстаИИ);
		
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON = новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			ПолученныеДанные = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", Ответ.ПолучитьТелоКакСтроку());
		
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);

			Возврат ПолученныеДанные;
		Иначе	
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", Ответ.ПолучитьТелоКакСтроку());
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
			Возврат Неопределено;
		КонецЕсли;
		
    Исключение		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура; 
		Если СсылкаИсточник <> Неопределено Тогда 
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СсылкаИсточник);
		Иначе                                                
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", "Неопределено");	
		КонецЕсли;
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ОтправкаТекстаИИ);
		СтруктураHTTPЗапроса.Вставить("Код", 500);
		СтруктураHTTPЗапроса.Вставить("Описание", ОписаниеОшибки());
		
		СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
		
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

Функция ЗапросКFAQ(ТекстЗапроса, СсылкаИсточник = Неопределено) Экспорт 
		
	Попытка
		НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.ОпубликованныйСервер);
		Заголовки = НастройкиПодключения.Заголовки;
		Запрос = Новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[1], Заголовки); 
		
		СтруктураЗапроса = новый Структура;
		СтруктураЗапроса.Вставить("text", ТекстЗапроса);
		
		ЗаписьJSON = новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
		
		СтрокаЗапроса = ЗаписьJSON.Закрыть();

		
		Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(НастройкиПодключения.URL,,,,,90,ЗащищенноеСоединение);
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура; 
		Если СсылкаИсточник <> Неопределено Тогда 
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СсылкаИсточник);
		Иначе                                                
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", "Неопределено");	
		КонецЕсли;
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ПоискОтветаВFAQ);
		
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON = новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			ПолученныеДанные = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", Ответ.ПолучитьТелоКакСтроку());
			
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
			
			Возврат ПолученныеДанные.ans;
		Иначе	
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", Ответ.ПолучитьТелоКакСтроку());
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
			Возврат Неопределено;
		КонецЕсли;
	Исключение		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура; 
		Если СсылкаИсточник <> Неопределено Тогда 
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СсылкаИсточник);
		Иначе                                                
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", "Неопределено");	
		КонецЕсли;
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ПоискОтветаВFAQ);
		СтруктураHTTPЗапроса.Вставить("Код", 500);
		СтруктураHTTPЗапроса.Вставить("Описание", ОписаниеОшибки());
		
		СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
		
        Возврат Неопределено;
	КонецПопытки;
КонецФункции 

Функция ПолучитьСообщениеGemini(ТекстЗапроса) Экспорт
	Возврат Интеграции.ПолучитьСообщениеGemini(ТекстЗапроса);
КонецФункции

Функция СоздатьОбращениеВБазе(ТекстЗапроса, ОтветСервера, Источник, ЧатИД = Неопределено) Экспорт
    
    Попытка
        // Разбор JSON ответа
		//Данные = РазобратьJSONПравильно(ОтветСервера);
		Данные = ОтветСервера;
        Если Данные = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;

        // Создаем новое обращение
        НовоеОбращение = Справочники.Обращения.СоздатьЭлемент();

        // Заполняем основные поля
        НовоеОбращение.ТекстОбращения = ТекстЗапроса;
        
        // Заполняем тип (category)
        Категория = НРег(СокрЛП(Данные.category));
        Если Категория = "жалоба" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Жалоба;
        ИначеЕсли Категория = "техническая ошибка" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.ТехническаяОшибка;
        ИначеЕсли Категория = "вопрос по оплате" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.ВопросПоОплате;
        ИначеЕсли Категория = "предложение" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Предложение;
        Иначе
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Прочее;
        КонецЕсли;
        
        // Заполняем статус
        НовоеОбращение.Статус = Перечисления.СтатусыОбращения.Новое;
        
        // Заполняем приоритет (priority)
        Приоритет = НРег(СокрЛП(Данные.priority));
        Если Приоритет = "высокий" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Высокий;
        ИначеЕсли Приоритет = "срочный" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Срочный;
        ИначеЕсли Приоритет = "средний" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Средний;
        ИначеЕсли Приоритет = "низкий" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Низкий;
        Иначе
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Средний;
        КонецЕсли;
        
        // Заполняем тональность (tone)
        Тон = НРег(СокрЛП(Данные.tone));
        Если Тон = "нейтральная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Нейтральная;
        ИначеЕсли Тон = "позитивная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Позитивная;
        ИначеЕсли Тон = "негативная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Негативная;
        Иначе
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Нейтральная;
		КонецЕсли;
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ИсточникиОбращений") Тогда 
			НовоеОбращение.Автор = Источник.СсылкаНаАвтора;
			НовоеОбращение.Источник = Источник;
			
			НовоеОбращение.Наименование = Источник.ТемаОбращения;
			НовоеОбращение.ДатаСоздания = ТекущаяДатаСеанса(); 
			
			Если НовоеОбращение.Источник.ИсточникОбращения = Перечисления.ИсточникиОбращений.Телеграм Тогда 
				ЧатИД = НовоеОбращение.Источник.АвторОбращения;
				НовоеОбращение.ЧатИД = ЧатИД;
			КонецЕсли;

			ЗаписатьСостояниеОбращенийНаСервере(НовоеОбращение);  
			ЗаполнитьИсполнителя(НовоеОбращение);
			// Сохраняем 
			
			ОтветFAQ = ЗапросКFAQ(ТекстЗапроса, Источник.Ссылка);
			
			Если ОтветFAQ <> "К сожалению, в предоставленном документе нет информации об этом."  И ОтветFAQ <> Неопределено Тогда
				
				СтрокаКомментария = НовоеОбращение.Комментарии.Добавить();
				СтрокаКомментария.Дата = ТекущаяДатаСеанса();
				СтрокаКомментария.Комментарий = ОтветFAQ;
				СтрокаКомментария.Автор = "Нейросеть";
				СтрокаКомментария.Внешний = Истина;
				НовоеОбращение.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента;
				
				Если НовоеОбращение.Источник.ИсточникОбращения = Перечисления.ИсточникиОбращений.Телеграм Тогда 
					Интеграции.ОтправитьСообщениеТелеграм(ЧатИД, ОтветFAQ, Перечисления.СостоянияПользователей.ОцениваетВыполнение);	
				КонецЕсли;
				
			КонецЕсли;
			
			НовоеОбращение.Записать();
						
			ИсточникОб = Источник.ПолучитьОбъект();
			ИсточникОб.Статус = Перечисления.СтатусыОбработки.Обработан;
			ИсточникОб.Записать(); 
					
			ДатаСеанса = ТекущаяДатаСеанса();
			СтруктураHTTPЗапроса = Новый Структура; 
			
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", ИсточникОб.Ссылка);	
			СтруктураHTTPЗапроса.Вставить("Код", 200); 
			СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.СозданиеОбращенияНаОснованииИсточника);
			СтруктураHTTPЗапроса.Вставить("Описание", СтрШаблон("На основании источника было создано новое обращение %1", НовоеОбращение.Ссылка));
			
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
			
			Если НовоеОбращение.Источник.ИсточникОбращения = Перечисления.ИсточникиОбращений.Сайт Тогда 
				ОтправитьОбращениеВЭлемент(НовоеОбращение.Ссылка);
			КонецЕсли;
			
		Иначе
			НовоеОбращение.Автор = ПользователиИнформационнойБазы.ТекущийПользователь();
			НовоеОбращение.Источник = Источник;
			// Дата = ТекущаяДата(); // Убрали если нет такого поля
			
			// Создаем наименование
			КороткийТекст = ТекстЗапроса;
			Если СтрДлина(КороткийТекст) > 50 Тогда
				КороткийТекст = Лев(КороткийТекст, 50) + "...";
			КонецЕсли;
			НовоеОбращение.Наименование = КороткийТекст;
			НовоеОбращение.ДатаСоздания = ТекущаяДатаСеанса(); 
			НовоеОбращение.ЧатИД = ЧатИД;
			
			ЗаписатьСостояниеОбращенийНаСервере(НовоеОбращение);  
			ЗаполнитьИсполнителя(НовоеОбращение);
			// Сохраняем    
			
			ОтветFAQ = ЗапросКFAQ(ТекстЗапроса);
			
			Если ОтветFAQ <> "К сожалению, в предоставленном документе нет информации об этом." Тогда
				
				СтрокаКомментария = НовоеОбращение.Комментарии.Добавить();
				СтрокаКомментария.Дата = ТекущаяДатаСеанса();
				СтрокаКомментария.Комментарий = ОтветFAQ;
				СтрокаКомментария.Автор = "Нейросеть";
				СтрокаКомментария.Внешний = Истина;
				НовоеОбращение.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента;
				
			КонецЕсли; 
			
			НовоеОбращение.Записать();
			
			Если Источник <> Перечисления.ИсточникиОбращений.Сайт Тогда 
				Сообщить("Обращение успешно создано!");
				Возврат Истина; 
			Иначе 
				Возврат НовоеОбращение.Ссылка;	
			КонецЕсли; 
			
		КонецЕсли;
		
	Исключение
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ИсточникиОбращений") Тогда 
			ДатаСеанса = ТекущаяДатаСеанса();
			СтруктураHTTPЗапроса = Новый Структура; 
			
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", Источник.Ссылка);	
			СтруктураHTTPЗапроса.Вставить("Код", 500); 
			СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.СозданиеОбращенияНаОснованииИсточника);
			СтруктураHTTPЗапроса.Вставить("Описание", "Ошибка при создании обращения: " + ОписаниеОшибки());
			
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);	
		КонецЕсли;	
		
		Если Источник <> Перечисления.ИсточникиОбращений.Сайт Тогда
			Сообщить("Ошибка при создании обращения: " + ОписаниеОшибки());
			Возврат Ложь;
		Иначе 
			Возврат Неопределено;	
		КонецЕсли;
    КонецПопытки;
    
КонецФункции

//Вызывать при записи справочника обращения
Процедура ЗаписатьСостояниеОбращенийНаСервере(Объект) Экспорт  
	
	ДатаСеанса = ТекущаяДатаСеанса();
	Объект.ДатаОбновления = ДатаСеанса;
	СтруктураОбращения = Новый Структура("Обращение, Сотрудник, Статус, СлужебныйКомментарий");
	СтруктураОбращения.Обращение = Объект.Ссылка;
	СтруктураОбращения.Статус = Объект.Статус;

	НовоеОбращение = Ложь;
	Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда 
		НовоеОбращение = Истина;			
	КонецЕсли;
	
	Если НовоеОбращение Тогда  	
		СтруктураОбращения.Сотрудник = Справочники.Пользователи.СистемныйПользователь;
		СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Обращение", Объект.Ссылка);
		ПоследнееОбращение = РегистрыСведений.СостояниеОбращений;
		ТекВерсияОбращения = ПоследнееОбращение.ПолучитьПоследнее(ДатаСеанса, Отбор);
		
		Если ТекВерсияОбращения.СтатусРесурс = Объект.Статус Тогда 
			Возврат;
		Иначе  
			СтруктураОбращения.Сотрудник = Объект.Исполнитель;
			Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда  
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 	
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение принято в работу. Исполнитель: %1", Объект.Исполнитель); 
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение передано клиенту: %1", Объект.Автор);
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ВозвращеноКлиентом Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Клиент вернул обращение на доработку");	
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.Закрыто Тогда 	
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение закрыто"); 
			КонецЕсли; 
			
			Решение = 0;
			Реакция = 0;
			ПовторнаяРеакция = 0;
			
			Если ТекВерсияОбращения.СтатусРесурс = Перечисления.СтатусыОбращения.Новое И Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда	
				Реакция = РегистрыСведений.СостояниеОбращений.ПолучитьВремяРеакцииНаТекПериод(Объект.Ссылка, ДатаСеанса);	
			ИначеЕсли ТекВерсияОбращения.СтатусРесурс = Перечисления.СтатусыОбращения.ВРаботе И Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 	
				Решение = РегистрыСведений.СостояниеОбращений.ПолучитьВремяРешенияНаТекПериод(Объект.Ссылка, ДатаСеанса, Перечисления.СтатусыОбращения.ВРаботе);
			ИначеЕсли ТекВерсияОбращения.СтатусРесурс = Перечисления.СтатусыОбращения.ВозвращеноКлиентом И Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 	
				ПовторнаяРеакция = РегистрыСведений.СостояниеОбращений.ПолучитьВремяРешенияНаТекПериод(Объект.Ссылка, ДатаСеанса, Перечисления.СтатусыОбращения.ВозвращеноКлиентом);	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
	Запись = РегистрыСведений.ПоказателиSLAПоОбращениям.СоздатьМенеджерЗаписи();
    Запись.Обращение = Объект.Ссылка;
    Запись.Прочитать();
	
	Реакция = ?(Реакция = Неопределено, 0, Реакция);
	Решение = ?(Решение = Неопределено, 0, Решение);
	ПовторнаяРеакция = ?(ПовторнаяРеакция = Неопределено, 0, ПовторнаяРеакция);
	
    Если Запись.Выбран() Тогда
        Запись.Реакция = Запись.Реакция + Реакция;
        Запись.Решение = Запись.Решение + Решение;
		Запись.ПовторнаяРеакция = Запись.ПовторнаяРеакция + ПовторнаяРеакция;
        Запись.Записать(Истина);
    Иначе
        Запись.Обращение = Объект.Ссылка;
        Запись.Реакция = Реакция;
        Запись.Решение = Решение; 
		Запись.ПовторнаяРеакция = ПовторнаяРеакция;
        Запись.Записать(Истина);
    КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостояниеОбращений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Объект.Ссылка); 
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	
	Запись = НаборЗаписей.Добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, СтруктураОбращения);
	Запись.Период = ДатаСеанса;
	Запись.СтатусРесурс = Запись.Статус;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьИсполнителя(Объект, НазначаемаяЛиния = Неопределено) Экспорт
	
	ПриоритетОбращения = Объект.Приоритет;
	ИсполнительНазначен = Ложь;
	СтатусВРаботе = Перечисления.СтатусыОбращения.ВРаботе;
	
	Если НазначаемаяЛиния = Неопределено Тогда
		НазначаемаяЛиния = Перечисления.ЛинииПоддержки.Первая;
	КонецЕсли;
	
	Если ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Срочный Тогда
		
	    МинимальныйТребуемыйБалл = 4;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Высокий Тогда
		
	    МинимальныйТребуемыйБалл = 3;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Средний Тогда
		
	    МинимальныйТребуемыйБалл = 2;
	    
	Иначе
		
	    МинимальныйТребуемыйБалл = 0; 
	    
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Исполнитель,
		|	КОЛИЧЕСТВО(Обращения.Ссылка) КАК КоличествоОбращений
		|ПОМЕСТИТЬ втЗанятость
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обращения КАК Обращения
		|		ПО Пользователи.Ссылка = Обращения.Исполнитель
		|		И Обращения.Статус = &Статус
		|ГДЕ
		|	Пользователи.Специализация = &Специализация
		|СГРУППИРОВАТЬ ПО
		|	Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗанятость.Исполнитель КАК Сотрудник,
		|	НавыкиСотрудников.КоличествоБаллов / НавыкиСотрудников.КоличествоВопросов КАК СреднийБалл,
		|	втЗанятость.КоличествоОбращений КАК КоличествоОбращений
		|ИЗ
		|	втЗанятость КАК втЗанятость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НавыкиСотрудников КАК НавыкиСотрудников
		|		ПО втЗанятость.Исполнитель = НавыкиСотрудников.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОбращений,
		|	СреднийБалл УБЫВ";
	
	Если НазначаемаяЛиния <> Неопределено Тогда

		ТекстПоиска = 
		   "|	Пользователи.Специализация = &Специализация";
		
		ТекстЗамены =
		   "|	Пользователи.Специализация = &Специализация
			|	И Пользователи.ЛинияПоддержки = &ЛинияПоддержки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстПоиска, ТекстЗамены);
		Запрос.УстановитьПараметр("ЛинияПоддержки", НазначаемаяЛиния);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Статус", СтатусВРаботе);
	Запрос.УстановитьПараметр("Специализация", Объект.Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.СреднийБалл = NULL Тогда

			Если Выборка.СреднийБалл > МинимальныйТребуемыйБалл Тогда
				
	    		Объект.Исполнитель = Выборка.Сотрудник;
	    		ИсполнительНазначен = Истина;
	    		Прервать;
	    		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ИсполнительНазначен Тогда
		
		Сообщить("Не удалось автоматически подобрать оптимального Исполнителя");
		
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьОбращениеВЭлемент(СсылкаОбращения) Экспорт
	
	НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.СервисДескЭлемент);

	payload = Новый Структура;
	payload.Вставить("УуидЭлемента", СсылкаОбращения.Источник.УникальноеЗначениеДляПоиска);
	payload.Вставить("УуидПредприятия", Строка(СсылкаОбращения.УникальныйИдентификатор()));  
	payload.Вставить("Статус", Строка(СсылкаОбращения.Статус));  
	payload.Вставить("ФиоИсполнителя", СсылкаОбращения.Исполнитель.Наименование);  
	МассивСтруктур = Новый Массив;
	Для каждого Элем Из СсылкаОбращения.Комментарии Цикл
		Если Элем.Внешний Тогда  
			Если ТипЗнч(Элем.Автор) = Тип("Строка") Тогда
				ТЧАвтор = Элем.Автор;
			Иначе
				ТЧАвтор = Элем.Автор.Наименование;
			КонецЕсли;
			МассивСтруктур.Добавить(новый Структура("ФиоАвтор, Комментарий, Дата", ТЧАвтор, Элем.Комментарий, Элем.Дата)); 	
		КонецЕсли;	
	КонецЦикла;
	Если МассивСтруктур.Количество() <> 0 Тогда 
		payload.Вставить("КомментарииТЧ", МассивСтруктур); 
	КонецЕсли;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, payload); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Токен = ПолучитьТокен();    
	
	Если Токен <> Неопределено Тогда  
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", НастройкиПодключения.Заголовки.Получить("ContentTypeОтправка"));
		Заголовки.Вставить("Authorization", СтрШаблон(НастройкиПодключения.Заголовки.Получить("АвторизацияОтправка"), Токен));

		Запрос = Новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[1], Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);

		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(НастройкиПодключения.URL,,,,,90,ЗащищенноеСоединение);
		Ответ = Соединение.ВызватьHTTPМетод("PUT", Запрос);
		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура; 
		СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СсылкаОбращения);
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ОтправкаДанныхВЭлемент);

		
		Если Ответ.КодСостояния = 200 Тогда
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", "Данные отправлены в Элемент");
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
		Иначе	
			СтруктураHTTPЗапроса.Вставить("Код",  Ответ.КодСостояния);
			СтруктураHTTPЗапроса.Вставить("Описание", Ответ.ПолучитьТелоКакСтроку());
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураHTTPЗапроса.ОбъектЗапроса, СтруктураHTTPЗапроса);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры 

Функция ПолучитьТокен()
	
	НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.СервисДескЭлемент);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
    Соединение = Новый HTTPСоединение(НастройкиПодключения.URL,,,,,90,ЗащищенноеСоединение);
    
    ClientId = НастройкиПодключения.Логин;
    ClientSecret = НастройкиПодключения.Пароль;
    
	CredentialsString = ClientId + ":" + ClientSecret;
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(CredentialsString, КодировкаТекста.UTF8);
	Base64Auth = Base64Строка(ДвоичныеДанные);
	Base64Auth = СтрЗаменить(Base64Auth, Символы.ПС, "");
	Base64Auth = СтрЗаменить(Base64Auth, Символы.ВК, ""); 
	Base64Auth = СтрЗаменить(Base64Auth, " ", "");     

	Заголовки = Новый Соответствие;

	Заголовки.Вставить("Content-Type", НастройкиПодключения.Заголовки.Получить("ContentTypeТокен"));
	Заголовки.Вставить("Authorization", СтрШаблон(НастройкиПодключения.Заголовки.Получить("АвторизацияТокен"), Base64Auth));
    
    Запрос = Новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[0], Заголовки);
    
    Запрос.УстановитьТелоИзСтроки("grant_type=CLIENT_CREDENTIALS", КодировкаТекста.UTF8);
    
    Попытка
        Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
        
        Если Ответ.КодСостояния = 200 Тогда
            ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
            ЧтениеJSON = Новый ЧтениеJSON;
            ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
            ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON, Истина);
            ЧтениеJSON.Закрыть();
			Токен = ДанныеОтвета["id_token"];
            Возврат Токен;
        Иначе
            Сообщить("Ошибка: " + Ответ.КодСостояния);
            Сообщить("Ответ сервера: " + Ответ.ПолучитьТелоКакСтроку());
            Возврат Неопределено;
        КонецЕсли;
        
    Исключение
        Сообщить(ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

Функция БинарныеДанныеВСтрокуUTF8(БинарныеДанные)
    
    Попытка
        // Временный файл для конвертации
        ВременныйФайл = ПолучитьИмяВременногоФайла("txt"); 
        
        // Создаем COM-объект для работы с потоком
        Поток = Новый COMОбъект("ADODB.Stream");
        Поток.Type = 1; // adTypeBinary - указываем, что работаем с бинарными данными
        Поток.Open();
        
        // Помещаем бинарные данные в поток
        Поток.Write(БинарныеДанные);
        Поток.Position = 0; // Возвращаемся в начало потока
        
        // Меняем тип потока на текстовый и указываем кодировку
        Поток.Type = 2; // adTypeText
        Поток.Charset = "utf-8"; // Указываем кодировку исходных данных
        
        // Читаем текст из потока
        Результат = Поток.ReadText();
        Поток.Close();
        
        Возврат Результат;
        
    Исключение
        Сообщить("Ошибка преобразования бинарных данных: " + ОписаниеОшибки());
        Возврат "";
    КонецПопытки;
    
КонецФункции

Функция РазобратьJSONПравильно(JSONСтрока)
    
    Попытка
        Сообщить("Получен ответ от сервера: " + JSONСтрока);
        
        // РУЧНОЙ РАЗБОР JSON через строковые функции
        Данные = Новый Структура;
        
        // Убираем фигурные скобки и пробелы
        JSONСтрока = СокрЛП(СтрЗаменить(JSONСтрока, "{", ""));
        JSONСтрока = СокрЛП(СтрЗаменить(JSONСтрока, "}", ""));
        
        // Разбиваем по запятым на отдельные пары "ключ:значение"
        Пары = СтрРазделить(JSONСтрока, ",");
        
        Для Каждого Пара Из Пары Цикл
            Пара = СокрЛП(Пара);
            Если Найти(Пара, ":") > 0 Тогда
                // Разбиваем на ключ и значение
                КлючИЗначение = СтрРазделить(Пара, ":");
                Если КлючИЗначение.Количество() >= 2 Тогда
                    Ключ = СокрЛП(СтрЗаменить(КлючИЗначение[0], """", ""));
                    Значение = СокрЛП(СтрЗаменить(КлючИЗначение[1], """", ""));
                    Данные.Вставить(Ключ, Значение);
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        
        // Выводим что получили
        Сообщить("Успешно разобрано полей: " + Данные.Количество());
        Для Каждого Элемент Из Данные Цикл
            Сообщить(Элемент.Ключ + " = " + Элемент.Значение);
        КонецЦикла;
        
        Возврат Данные;
        
    Исключение
        Сообщить("Ошибка при разборе JSON: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

Функция ПолучитьАвтораПоФИО(ФИО) Экспорт 
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыCRM.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлиентыCRM КАК КлиентыCRM
		|ГДЕ
		|	КлиентыCRM.Наименование = &Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ФИО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	Возврат ВыборкаДетальныеЗаписи.Ссылка
	КонецЦикла;
	
	НовПользователь = Справочники.КлиентыCRM.СоздатьЭлемент();
	НовПользователь.Наименование = ФИО;
	НовПользователь.Записать();
	
	Возврат НовПользователь.Ссылка;
	
КонецФункции 

Процедура ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, ОбъектЗапроса, СтруктураHTTPЗапроса) Экспорт 
	НаборЗаписей = РегистрыСведений.СтатусыHTTPЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектЗапроса.Установить(ОбъектЗапроса); 
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	
	Запись = НаборЗаписей.Добавить(); 
	Запись.Период = ДатаСеанса; 
	ЗаполнитьЗначенияСвойств(Запись, СтруктураHTTPЗапроса);
	
	НаборЗаписей.Записать();	
КонецПроцедуры
